/*Задача 10: Напишите программу, 
которая принимает на вход трёхзначное число 
и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1
*/
/*
Console.Clear();
Console.Write("Введите трёхзначное число: ");
int numA = Convert.ToInt32(Console.ReadLine());
int MetodResul(int result)
{
    int resulA = result / 10;
    int resulB = resulA % 10;
    return resulB;
}
int metodResul = MetodResul(numA);
Console.WriteLine($"{numA} -> {metodResul}");
*/
//------------------------------------------------------------------------------------------------
/*Задача 13: Напишите программу, 
которая выводит третью цифру заданного числа 
или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6
*/

/*Console.Clear();
Console.Write("Введите число: ");
int numA = Convert.ToInt32(Console.ReadLine());
if (numA < 99)
{
    Console.WriteLine($"{numA} -> третьей цифры нет");
}
else
{
    int resulA = numA % 10;
    Console.WriteLine($"{numA} -> {resulA}");
}
*/

/